/***********************************************************
 * @Description : 字符串初始化
 * C语言没有字符串类型，通过字符串数组模拟
 * C语言字符串，以字符'\0'结尾，\0也可以认为整数0
 * @author      : 梁山广(Liang Shan Guang)
 * @date        : 2020/1/12 12:42
 * @email       : liangshanguang2@gmail.com
***********************************************************/
#include <stdio.h>

int main() {
    printf("不指定长度，没有反斜杠0作为结束符，有多少个元素就有多长，输出时会乱码");
    char buf1[] = {'a', 'b', 'c'};
    printf("buf = %s\n", buf1); // 没有指定结束的\0，所以乱码

    printf("指定长度，后面没有赋值的元素，自动补0，0就相当于反斜杠0了，所以不乱码：");
    char buf2[100] = {'a', 'b', 'c'};
    printf("buf2 = %s\n", buf2);

    printf("所有元素赋值为0：");
    char buf3[100] = {0};
    printf("buf3 = %s\n", buf3);

    char buf5[50] = {'l', 'a', 'b', '0', '7'};
    printf("buf5 = %s\n", buf5);

    char buf6[50] = {'l', 'a', 'b', 0, '7'}; // 这里的0就相当于反斜杠0作为字符串的结束符了
    printf("buf6 = %s\n", buf6);

    char buf7[50] = {'l', 'a', 'b', '\0', '7'}; // 这里的0就相当于反斜杠0作为字符串的结束符了
    printf("buf7 = %s\n", buf7);

    // \0后面最好不好连着数组，几个数字连起来可能刚好是一个转移字符，比如'\ddd'是八进制子义字符，'\xdd'是十六进制转义字符，\012相当于\n
    char str[] = "\012abc";
    printf("str = %s\n", str);
    return 0;
}
/**
 *不指定长度，没有反斜杠0作为结束符，有多少个元素就有多长，输出时会乱码buf = abc
指定长度，后面没有赋值的元素，自动补0，0就相当于反斜杠0了，所以不乱码：buf2 = abc
所有元素赋值为0：buf3 =
buf5 = lab07
buf6 = lab
buf7 = lab
str =
abc
 */
